src/DemoApp/src/Catalogs/Валюты/Валюты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Валюты</name>
  <attributes>
    <name>НаименованиеОсновнойВалюты</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеРазменнойВалюты</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦифровойКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СимвольныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/DemoApp/src/Catalogs/Валюты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(СимвольныйКод) Тогда

		СимвольныйКод = ВРег(СокрЛП(СимвольныйКод));

	КонецЕсли;

	Если ЗначениеЗаполнено(ЦифровойКод) Тогда

		Если СтрДлина(ЦифровойКод) <> 3 Тогда

			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Цифровой код валюты должен содержать 3 цифры.";
			Сообщение.Сообщить();

			Отказ = Истина;
			Возврат;

		КонецЕсли;

		Для НомерСимвола = 1 По 3 Цикл

			Если СтрНайти("0123456789", Сред(ЦифровойКод, НомерСимвола, 1)) = 0 Тогда

				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Цифровой код валюты должен содержать только цифры.";
				Сообщение.Сообщить();

				Отказ = Истина;
				Возврат;

			КонецЕсли;

		КонецЦикла;

	КонецЕсли;

	Если Кратность <= 0 Тогда

		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Кратность валюты должна быть больше нуля.";
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
